{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\g1ysl01\Documents\Arce_consumption\storico_stata\tableD1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Sep 2021, 11:38:31
{txt}
{com}. 
. use comp.dta
{txt}
{com}. drop if nord != 1
{txt}(284,340 observations deleted)

{com}. merge 1:1 nquest anno using rfam
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         154,792{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. merge 1:1 nquest anno using cons
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         154,792{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. merge 1:1 nquest anno using peso
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}         154,792{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. //Rename colsrename anno year
. rename eta age
{res}{txt}
{com}. rename ncomp hhold_size
{res}{txt}
{com}. rename sesso gender
{res}{txt}
{com}. rename ireg region 
{res}{txt}
{com}. rename anno year
{res}{txt}
{com}. rename peso weight
{res}{txt}
{com}. 
. keep nquest year age hhold_size gender region weight y* cn acom5 studio
{txt}
{com}. 
. //Drop data before 1995, n=86729
. drop if year < 1995
{txt}(68,063 observations deleted)

{com}. 
. //After dropping if residing in a small location n=75977 (same as paper)
. drop if acom5 == 1
{txt}(10,752 observations deleted)

{com}. 
. //After dropping if age of household head outside [25,60] n=42202 (vs 43,505 in paper)
. drop if age<25
{txt}(541 observations deleted)

{com}. drop if age>60
{txt}(33,234 observations deleted)

{com}. 
. //Create consumption as in paper
. //gen consumption = cn/hhold_size
. gen consumption = cn - yca2 - yl2
{txt}
{com}. gen consumption_pc = cn/hhold_size
{txt}
{com}. gen income = (yl1+yt+ym+yc)
{txt}
{com}. 
. //Deflate income and consumption variables using OECD CPI numbers (base year is 2015)
. replace income = income/(86.4/100) if year == 2006
{txt}(3,682 real changes made)

{com}. replace consumption = consumption/(86.4/100) if year == 2006
{txt}(3,686 real changes made)

{com}. replace income = income/(99.9/100) if year == 2014
{txt}(3,387 real changes made)

{com}. replace consumption = consumption/(99.9/100) if year == 2014
{txt}(3,424 real changes made)

{com}. /*replace income = income/(.9384078) if year == 2006
> replace consumption = consumption/(.9384078) if year == 2006
> replace income = income/(1.072381) if year == 2014
> replace consumption = consumption/(1.072381) if year == 2014
> */
. 
. //Drop if negative income/consumption
. drop if income<.01
{txt}(235 observations deleted)

{com}. drop if consumption < .01
{txt}(6 observations deleted)

{com}. 
. //Define income to consumption ration
. gen inc_cons_ratio = income/consumption
{txt}
{com}. 
. //gen cutoff vals and use to trim top and bottom .5% of data
. //Basically adding wieghts in order until get .5% of weight then use current inc_cons_ratio as cutoff val
. sort(inc_cons_ratio)
{txt}
{com}. egen total_weight = sum(weight)
{txt}
{com}. local bot_cutoff = 0
{txt}
{com}. local top_cutoff = 0
{txt}
{com}. local curr_weight = 0
{txt}
{com}. local N = _N
{txt}
{com}. forval i = 1/`N'{c -(}
{txt}  2{com}.     local curr_weight = `curr_weight' + weight[`i']
{txt}  3{com}.         if `curr_weight' > .005*total_weight[1]{c -(}
{txt}  4{com}.             local bot_cutoff = inc_cons_ratio[`i'-1]
{txt}  5{com}.                 continue, break
{txt}  6{com}.         {c )-}
{txt}  7{com}. {c )-}
{txt}
{com}. local curr_weight = 0
{txt}
{com}. forval i = 0/`N'{c -(}
{txt}  2{com}.     local curr_weight = `curr_weight' + weight[`N' - `i']
{txt}  3{com}.         if `curr_weight' > .005*total_weight[1]{c -(}
{txt}  4{com}.             local top_cutoff = inc_cons_ratio[_N - `i' + 1]
{txt}  5{com}.                 continue, break
{txt}  6{com}.         {c )-}
{txt}  7{com}. {c )-}
{txt}
{com}. 
. //Use cutoffs to drop top and bot .5% of data
. drop if inc_cons_ratio > `top_cutoff'
{txt}(198 observations deleted)

{com}. drop if inc_cons_ratio < `bot_cutoff'
{txt}(180 observations deleted)

{com}. 
. //After dropping outliers and negative income n=41740 (vs 42,286 in paper)
. 
. //After dropping all data not in 2006 or 2014 n=7036 (vs 7060 in paper)
. drop if year != 2006 & year != 2014
{txt}(34,574 observations deleted)

{com}. 
. 
. //gen log consumption var
. gen ln_cons = log(consumption)
{txt}
{com}. gen ln_cons_pc = log(consumption_pc)
{txt}
{com}. 
. //Literally just get average log consumption in 2006 and 2014 using weights
. sum ln_cons if year == 2006 [aweight = weight]

{txt}    Variable {c |}     Obs      Weight        Mean   Std. dev.       Min        Max
{hline 13}{c +}{hline 65}
{space 5}ln_cons {c |}{res}   3,652  3589.10895    9.804188   .4679377   7.236259   11.84143
{txt}
{com}. sum ln_cons if year == 2014 [aweight = weight]

{txt}    Variable {c |}     Obs      Weight        Mean   Std. dev.       Min        Max
{hline 13}{c +}{hline 65}
{space 5}ln_cons {c |}{res}   3,357  3673.88405    9.554448   .5409479   7.091077   11.69625
{txt}
{com}. sum ln_cons_pc if year == 2006 [aweight = weight]

{txt}    Variable {c |}     Obs      Weight        Mean   Std. dev.       Min        Max
{hline 13}{c +}{hline 65}
{space 2}ln_cons_pc {c |}{res}   3,652  3589.10895    9.032544   .5714448   6.234411   11.42191
{txt}
{com}. sum ln_cons_pc if year == 2014 [aweight = weight]

{txt}    Variable {c |}     Obs      Weight        Mean   Std. dev.       Min        Max
{hline 13}{c +}{hline 65}
{space 2}ln_cons_pc {c |}{res}   3,357  3673.88405    8.987435   .6081696   6.214608   11.52089
{txt}
{com}. 
{txt}end of do-file

{com}. exit, clear
